Repository: MathRoy12/mobile_avancee_tp3
Catalog: lib/l10n/intl_*.arb
Languages: fr

source: Username
fr: Nom d'utilisateur

source: Password
fr: Mot de passe

source: Confirm password
fr: Confirmez votre mot de passe

source: Home
fr: Accueil

source: New task
fr: Nouvelle tâche

source: Log out
fr: Déconnexion

source: name
fr: nom

source: Deadline
fr: Échéance

source: Select deadline
fr: Choisissez votre échéance

# selectImage
source: Select an image
fr: Sélectionner une image

# percentageDoneHome
source: {percentage}% done
fr: {percentage}% d'effectuer

# percentageDoneDetail
source: Percentage done:
fr: Pourcentage effectué:

# timeElapsed
source: {percentage}% of time elapsed
fr: {percentage}% du temps d'écoulé

# usernameValidation
source: You need to enter a username
fr: Vous devez entrez un nom d'utilisateur

# passwordValidation
source: You need to enter a password
fr: Veuillez écrire votre mot de passe

# confirmPasswordValidation
source: You need to confirm your password
fr: Veuillez confirmé votre mot de passe

# samePasswordValidation
source: Your confirmation isn't like your password
fr: Votre confirmation n'est pas comme votre mot de passe

# nameValidation
source: The task need a name
fr: La tache doit avoir un nom

# globalError
source: An error as occurred
fr: Une erreur c'est produite

# dateFormat
source: MMMM dd y
fr: dd MMMM y

# badCredentials
source: Your password or username is wrong
fr: Votre nom d'utilisateur ou votre mot de passe est mauvais

# taskNotFound
source: The task wasn't found
fr: The taks wasn't found

# usernameTooShort
source: Your username is too short
fr: Votre nom d'utilisateur est trop court

# passwordTooShort
source: your password is too short
fr: Votre mot de passe est trop court

# usernameAlreadyTaken
source: this username is already taken
fr: Ce nom d'utilisateur est déjà pris
